[
  {
    "testCaseId": "squad2_where_is_normandy",
    "traceIds": [],
    "input": "In what country is Normandy located?",
    "output": "France",
    "context": [
      "The Normans (Norman: Nourmands; French: Normands; Latin: Normanni) were the people who in the 10th and 11th centuries gave their name to Normandy, a region in France. They were descended from Norse (\"Norman\" comes from \"Norseman\") raiders and pirates from Denmark, Iceland and Norway who, under their leader Rollo, agreed to swear fealty to King Charles III of West Francia. Through generations of assimilation and mixing with the native Frankish and Roman-Gaulish populations, their descendants would gradually merge with the Carolingian-based cultures of West Francia. The distinct cultural and ethnic identity of the Normans emerged initially in the first half of the 10th century, and it continued to evolve over the succeeding centuries."
    ],
    "groundTruth": "France"
  },
  {
    "testCaseId": "squad2_norman_dynasty_impact",
    "traceIds": [],
    "input": "What type of major impact did the Norman dynasty have on modern Europe?",
    "output": "",
    "context": [
      "The Norman dynasty had a major political, cultural and military impact on medieval Europe and even the Near East. The Normans were famed for their martial spirit and eventually for their Christian piety, becoming exponents of the Catholic orthodoxy into which they assimilated. They adopted the Gallo-Romance language of the Frankish land they settled, their dialect becoming known as Norman, Normaund or Norman French, an important literary language. The Duchy of Normandy, which they formed by treaty with the French crown, was a great fief of medieval France, and under Richard I of Normandy was forged into a cohesive and formidable principality in feudal tenure. The Normans are noted both for their culture, such as their unique Romanesque architecture and musical traditions, and for their significant military accomplishments and innovations. Norman adventurers founded the Kingdom of Sicily under Roger II after conquering southern Italy on the Saracens and Byzantines, and an expedition on behalf of their duke, William the Conqueror, led to the Norman conquest of England at the Battle of Hastings in 1066. Norman cultural and military influence spread from these new European centres to the Crusader states of the Near East, where their prince Bohemond I founded the Principality of Antioch in the Levant, to Scotland and Wales in Great Britain, to Ireland, and to the coasts of north Africa and the Canary Islands."
    ],
    "groundTruth": ""
  },
  {
    "testCaseId": "squad2_eight_counties",
    "traceIds": [],
    "input": "What are the ties that best described what the \"eight counties\" are based on?",
    "output": "demographics and economic",
    "context": [
      "Southern California, often abbreviated SoCal, is a geographic and cultural region that generally comprises California's southernmost 10 counties. The region is traditionally described as \"eight counties\", based on demographics and economic ties: Imperial, Los Angeles, Orange, Riverside, San Bernardino, San Diego, Santa Barbara, and Ventura. The more extensive 10-county definition, including Kern and San Luis Obispo counties, is also used based on historical political divisions. Southern California is a major economic center for the state of California and the United States."
    ],
    "groundTruth": "demographics and economic"
  },
  {
    "testCaseId": "squad2_socal_border",
    "traceIds": [],
    "input": "What is the name of the border to the south?",
    "output": "Mexico–United States border",
    "context": [
      "To the east is the Colorado Desert and the Colorado River at the border with Arizona, and the Mojave Desert at the border with the state of Nevada. To the south is the Mexico–United States border."
    ],
    "groundTruth": "Mexico–United States border"
  },
  {
    "testCaseId": "squad2_earth_o2",
    "traceIds": [],
    "input": "Which gas makes up 20.8% of the Earth's atmosphere?",
    "output": "Diatomic oxygen",
    "context": [
      "Oxygen is a chemical element with symbol O and atomic number 8. It is a member of the chalcogen group on the periodic table and is a highly reactive nonmetal and oxidizing agent that readily forms compounds (notably oxides) with most elements. By mass, oxygen is the third-most abundant element in the universe, after hydrogen and helium. At standard temperature and pressure, two atoms of the element bind to form dioxygen, a colorless and odorless diatomic gas with the formula O2. Diatomic oxygen gas constitutes 20.8% of the Earth's atmosphere. However, monitoring of atmospheric oxygen levels show a global downward trend, because of fossil-fuel burning. Oxygen is the most abundant element by mass in the Earth's crust as part of oxide compounds such as silicon dioxide, making up almost half of the crust's mass."
    ],
    "groundTruth": "Diatomic oxygen gas"
  },
  {
    "testCaseId": "squad2_priestly_compound",
    "traceIds": [],
    "input": "By sunlight, what compound did Priestley concentrate on to make the gas he called \"dephlogisticated air\"?",
    "output": "mercuric oxide",
    "context": [
      "In the meantime, on August 1, 1774, an experiment conducted by the British clergyman Joseph Priestley focused sunlight on mercuric oxide (HgO) inside a glass tube, which liberated a gas he named \"dephlogisticated air\". He noted that candles burned brighter in the gas and that a mouse was more active and lived longer while breathing it. After breathing the gas himself, he wrote: \"The feeling of it to my lungs was not sensibly different from that of common air, but I fancied that my breast felt peculiarly light and easy for some time afterwards.\" Priestley published his findings in 1775 in a paper titled \"An Account of Further Discoveries in Air\" which was included in the second volume of his book titled Experiments and Observations on Different Kinds of Air. Because he published his findings first, Priestley is usually given priority in the discovery."
    ],
    "groundTruth": "mercuric oxide"
  },
  {
    "testCaseId": "squad2_percy_shelly",
    "traceIds": [],
    "input": "What famous author used similarity and likeness of Percy Shelly in his writing?",
    "output": "Henry David Thoreau",
    "context": [
      "Following the Peterloo massacre of 1819, poet Percy Shelley wrote the political poem The Mask of Anarchy later that year, that begins with the images of what he thought to be the unjust forms of authority of his time—and then imagines the stirrings of a new form of social action. It is perhaps the first modern[vague] statement of the principle of nonviolent protest. A version was taken up by the author Henry David Thoreau in his essay Civil Disobedience, and later by Gandhi in his doctrine of Satyagraha. Gandhi's Satyagraha was partially influenced and inspired by Shelley's nonviolence in protest and political action. In particular, it is known that Gandhi would often quote Shelley's Masque of Anarchy to vast audiences during the campaign for a free India."
    ],
    "groundTruth": "Henry David Thoreau"
  },
  {
    "testCaseId": "squad2_civil_disobedience",
    "traceIds": [],
    "input": "How is civil disobedience typically defined in connection of the citizen's?",
    "output": "relation to the state and its laws",
    "context": [
      "Civil disobedience is usually defined as pertaining to a citizen's relation to the state and its laws, as distinguished from a constitutional impasse in which two public agencies, especially two equally sovereign branches of government, conflict. For instance, if the head of government of a country were to refuse to enforce a decision of that country's highest court, it would not be civil disobedience, since the head of government would be acting in her or his capacity as public official rather than private citizen."
    ],
    "groundTruth": "as pertaining to a citizen's relation to the state and its laws"
  },
  {
    "testCaseId": "squad2_block_switching",
    "traceIds": [],
    "input": "What did Distributed Adaptive Message Block Switching contradict?",
    "output": "principles of pre-allocation of network bandwidth",
    "context": [
      "Starting in the late 1950s, American computer scientist Paul Baran developed the concept Distributed Adaptive Message Block Switching with the goal to provide a fault-tolerant, efficient routing method for telecommunication messages as part of a research program at the RAND Corporation, funded by the US Department of Defense. This concept contrasted and contradicted the theretofore established principles of pre-allocation of network bandwidth, largely fortified by the development of telecommunications in the Bell System. The new concept found little resonance among network implementers until the independent work of Donald Davies at the National Physical Laboratory (United Kingdom) (NPL) in the late 1960s. Davies is credited with coining the modern name packet switching and inspiring numerous packet switching networks in Europe in the decade following, including the incorporation of the concept in the early ARPANET in the United States."
    ],
    "groundTruth": "This concept contrasted and contradicted the theretofore established principles of pre-allocation of network bandwidth"
  },
  {
    "testCaseId": "squad2_baran_research",
    "traceIds": [],
    "input": "What concept did Baran research for the US Air Force?",
    "output": "",
    "context": [
      "Baran developed the concept of distributed adaptive message block switching during his research at the RAND Corporation for the US Air Force into survivable communications networks, first presented to the Air Force in the summer of 1961 as briefing B-265, later published as RAND report P-2626 in 1962, and finally in report RM 3420 in 1964. Report P-2626 described a general architecture for a large-scale, distributed, survivable communications network. The work focuses on three key ideas: use of a decentralized network with multiple paths between any two points, dividing user messages into message blocks, later called packets, and delivery of these messages by store and forward switching."
    ],
    "groundTruth": "distributed adaptive message block switching"
  },
  {
    "testCaseId": "squad2_norman_exports",
    "traceIds": [],
    "input": "What was one of the Norman's major exports?",
    "output": "Tulips and Daffodils",
    "context": [
      "The Normans thereafter adopted the growing feudal doctrines of the rest of France, and worked them into a functional hierarchical system in both Normandy and in England. The new Norman rulers were culturally and ethnically distinct from the old French aristocracy, most of whom traced their lineage to Franks of the Carolingian dynasty. Most Norman knights remained poor and land-hungry, and by 1066 Normandy had been exporting fighting horsemen for more than a generation. Many Normans of Italy, France and England eventually served as avid Crusaders under the Italo-Norman prince Bohemund I and the Anglo-Norman king Richard the Lion-Heart."
    ],
    "groundTruth": "fighting horsemen"
  },
  {
    "testCaseId": "squad2_herve",
    "traceIds": [],
    "input": "When did Herve serve as a Norman general?",
    "output": "Asia Minor",
    "context": [
      "One of the first Norman mercenaries to serve as a Byzantine general was Hervé in the 1050s. By then however, there were already Norman mercenaries serving as far away as Trebizond and Georgia. They were based at Malatya and Edessa, under the Byzantine duke of Antioch, Isaac Komnenos. In the 1060s, Robert Crispin led the Normans of Edessa against the Turks. Roussel de Bailleul even tried to carve out an independent state in Asia Minor with support from the local population, but he was stopped by the Byzantine general Alexius Komnenos."
    ],
    "groundTruth": ""
  },
  {
    "testCaseId": "squad2_hollywood",
    "traceIds": [],
    "input": "Where is Hollywood located?",
    "output": "Los Angeles",
    "context": [
      "Within southern California are two major cities, Los Angeles and San Diego, as well as three of the country's largest metropolitan areas. With a population of 3,792,621, Los Angeles is the most populous city in California and the second most populous in the United States. To the south and with a population of 1,307,402 is San Diego, the second most populous city in the state and the eighth most populous in the nation."
    ],
    "groundTruth": ""
  },
  {
    "testCaseId": "squad2_la_district",
    "traceIds": [],
    "input": "Where is Los Angeles a district of?",
    "output": "Hollywood",
    "context": [
      "The motion picture, television, and music industry is centered on the Los Angeles in southern California. Hollywood, a district within Los Angeles, is also a name associated with the motion picture industry. Headquartered in southern California are The Walt Disney Company (which also owns ABC), Sony Pictures, Universal, MGM, Paramount Pictures, 20th Century Fox, and Warner Brothers. Universal, Warner Brothers, and Sony also run major record companies as well."
    ],
    "groundTruth": ""
  },
  {
    "testCaseId": "squad2_priestley_1774",
    "traceIds": [],
    "input": "What did Priestley publish in 1774?",
    "output": "Pneumatica",
    "context": [
      "In the meantime, on August 1, 1774, an experiment conducted by the British clergyman Joseph Priestley focused sunlight on mercuric oxide (HgO) inside a glass tube, which liberated a gas he named \"dephlogisticated air\". He noted that candles burned brighter in the gas and that a mouse was more active and lived longer while breathing it. After breathing the gas himself, he wrote: \"The feeling of it to my lungs was not sensibly different from that of common air, but I fancied that my breast felt peculiarly light and easy for some time afterwards.\" Priestley published his findings in 1775 in a paper titled \"An Account of Further Discoveries in Air\" which was included in the second volume of his book titled Experiments and Observations on Different Kinds of Air. Because he published his findings first, Priestley is usually given priority in the discovery."
    ],
    "groundTruth": ""
  },
  {
    "testCaseId": "squad2_hematite",
    "traceIds": [],
    "input": "What is hematite?",
    "output": "A reddish-black mineral consisting of ferric oxide. It is an important ore of iron.",
    "context": [
      "Oxygen is present in the atmosphere in trace quantities in the form of carbon dioxide (CO2). The Earth's crustal rock is composed in large part of oxides of silicon (silica SiO2, as found in granite and quartz), aluminium (aluminium oxide Al2O3, in bauxite and corundum), iron (iron(III) oxide Fe2O3, in hematite and rust), and calcium carbonate (in limestone). The rest of the Earth's crust is also made of oxygen compounds, in particular various complex silicates (in silicate minerals). The Earth's mantle, of much larger mass than the crust, is largely composed of silicates of magnesium and iron."
    ],
    "groundTruth": ""
  },
  {
    "testCaseId": "squad2_silas_cobb",
    "traceIds": [],
    "input": "Who is Silas B. Cobb?",
    "context": [
      "The University of Chicago was created and incorporated as a coeducational, secular institution in 1890 by the American Baptist Education Society and a donation from oil magnate and philanthropist John D. Rockefeller on land donated by Marshall Field. While the Rockefeller donation provided money for academic operations and long-term endowment, it was stipulated that such money could not be used for buildings. The original physical campus was financed by donations from wealthy Chicagoans like Silas B. Cobb who provided the funds for the campus' first building, Cobb Lecture Hall, and matched Marshall Field's pledge of $100,000. Other early benefactors included businessmen Charles L. Hutchinson (trustee, treasurer and donor of Hutchinson Commons), Martin A. Ryerson (president of the board of trustees and donor of the Ryerson Physical Laboratory) Adolphus Clay Bartlett and Leon Mandel, who funded the construction of the gymnasium and assembly hall, and George C. Walker of the Walker Museum, a relative of Cobb who encouraged his inaugural donation for facilities."
    ],
    "output": "Silas Bowman Cobb was an American industrialist and pioneer who made his fortune through business and real estate ventures primarily in Chicago, Illinois.",
    "ground_truth": ""
  },
  {
    "testCaseId": "squad2_supreme_court_1978",
    "traceIds": [],
    "input": "What was the outcome of the courtcase 1978 Supreme Court case of FCC v. Pacifica Foundation?",
    "output": "The high court ruled 5–4 in favor of the FCC, holding that the Carlin routine was \"indecent but not obscene\".",
    "context": [
      "In cases where the criminalized behavior is pure speech, civil disobedience can consist simply of engaging in the forbidden speech. An example would be WBAI's broadcasting the track \"Filthy Words\" from a George Carlin comedy album, which eventually led to the 1978 Supreme Court case of FCC v. Pacifica Foundation. Threatening government officials is another classic way of expressing defiance toward the government and unwillingness to stand for its policies. For example, Joseph Haas was arrested for allegedly sending an email to the Lebanon, New Hampshire city councilors stating, \"Wise up or die.\""
    ],
    "groundTruth": ""
  },
  {
    "testCaseId": "squad2_packet_routing",
    "traceIds": [],
    "input": "How are packets routed?",
    "output": "Packets are routed individually.",
    "context": [
      "Packet mode communication may be implemented with or without intermediate forwarding nodes (packet switches or routers). Packets are normally forwarded by intermediate network nodes asynchronously using first-in, first-out buffering, but may be forwarded according to some scheduling discipline for fair queuing, traffic shaping, or for differentiated or guaranteed quality of service, such as weighted fair queuing or leaky bucket. In case of a shared physical medium (such as radio or 10BASE5), the packets may be delivered according to a multiple access scheme."
    ],
    "groundTruth": ""
  },
  {
    "testCaseId": "squad2_arpanet",
    "traceIds": [],
    "input": "Why was ARPANET developed in 1973?",
    "output": "To link computers at Pentagon-funded research institutions over telephone lines.",
    "context": [
      "The CYCLADES packet switching network was a French research network designed and directed by Louis Pouzin. First demonstrated in 1973, it was developed to explore alternatives to the early ARPANET design and to support network research generally. It was the first network to make the hosts responsible for reliable delivery of data, rather than the network itself, using unreliable datagrams and associated end-to-end protocol mechanisms. Concepts of this network influenced later ARPANET architecture."
    ],
    "groundTruth": ""
  }
]
